# SQL
Коронавирус застал мир врасплох, изменив привычный порядок вещей. В
свободное время жители городов больше не выходят на улицу, не посещают кафе
и торговые центры. Зато стало больше времени для книг. Это заметили
стартаперы — и бросились создавать приложения для тех, кто любит читать.
Ваша компания решила быть на волне и купила крупный сервис для чтения книг
по подписке. Ваша первая задача как аналитика — проанализировать базу
данных.
В ней — информация о книгах, издательствах, авторах, а также пользовательские
обзоры книг. Эти данные помогут сформулировать ценностное предложение для
нового продукта.
## Описание данных 
### Таблица books
Содержит данные о книгах:
- book_id — идентификатор книги;
- author_id — идентификатор автора;
- title — название книги;
- num_pages — количество страниц;
- publication_date — дата публикации книги;
- publisher_id — идентификатор издателя.
### Таблица authors
Содержит данные об авторах:
- author_id — идентификатор автора;
- author — имя автора.
### Таблица publishers
Содержит данные об издательствах:
- publisher_id — идентификатор издательства;
- publisher — название издательства;
### Таблица ratings
Содержит данные о пользовательских оценках книг:
- rating_id — идентификатор оценки;
- book_id — идентификатор книги;
- username — имя пользователя, оставившего оценку;
- rating — оценка книги.
### Таблица reviews
Содержит данные о пользовательских обзорах на книги:
- review_id — идентификатор обзора;
- book_id — идентификатор книги;
- username — имя пользователя, написавшего обзор;
- text — текст обзора.

<h1>Содержание<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Описание-данных" data-toc-modified-id="Описание-данных-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Описание данных</a></span><ul class="toc-item"><li><span><a href="#Таблица-books" data-toc-modified-id="Таблица-books-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Таблица books</a></span></li><li><span><a href="#Таблица-authors" data-toc-modified-id="Таблица-authors-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Таблица authors</a></span></li><li><span><a href="#Таблица-publishers" data-toc-modified-id="Таблица-publishers-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Таблица publishers</a></span></li><li><span><a href="#Таблица-ratings" data-toc-modified-id="Таблица-ratings-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Таблица ratings</a></span></li><li><span><a href="#Таблица-reviews" data-toc-modified-id="Таблица-reviews-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Таблица reviews</a></span></li></ul></li><li><span><a href="#Цели-исследования" data-toc-modified-id="Цели-исследования-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Цели исследования</a></span><ul class="toc-item"><li><span><a href="#Подключение-к-базе-данных" data-toc-modified-id="Подключение-к-базе-данных-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Подключение к базе данных</a></span></li></ul></li><li><span><a href="#Исследуйте-таблицы-—-выведите-первые-строки" data-toc-modified-id="Исследуйте-таблицы-—-выведите-первые-строки-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Исследуйте таблицы — выведите первые строки</a></span><ul class="toc-item"><li><span><a href="#Таблицы-хорошего-качества,-без-пропусков.-Все-открылись." data-toc-modified-id="Таблицы-хорошего-качества,-без-пропусков.-Все-открылись.-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Таблицы хорошего качества, без пропусков. Все открылись.</a></span></li></ul></li><li><span><a href="#Посчитайте,-сколько-книг-вышло-после-1-января-2000-года" data-toc-modified-id="Посчитайте,-сколько-книг-вышло-после-1-января-2000-года-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Посчитайте, сколько книг вышло после 1 января 2000 года</a></span><ul class="toc-item"><li><span><a href="#После-1-января-2000-года-вышло-819-книга." data-toc-modified-id="После-1-января-2000-года-вышло-819-книга.-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>После 1 января 2000 года вышло 819 книга.</a></span></li></ul></li><li><span><a href="#Для-каждой-книги-посчитайте-количество-обзоров-и-среднюю-оценку" data-toc-modified-id="Для-каждой-книги-посчитайте-количество-обзоров-и-среднюю-оценку-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Для каждой книги посчитайте количество обзоров и среднюю оценку</a></span><ul class="toc-item"><li><span><a href="#Максимально-количество-обзоров-набрала-книга-Memoirs-of-a-Geisha--8-шт-со-средним-рейтингом-4.14." data-toc-modified-id="Максимально-количество-обзоров-набрала-книга-Memoirs-of-a-Geisha--8-шт-со-средним-рейтингом-4.14.-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Максимально количество обзоров набрала книга Memoirs of a Geisha- 8 шт со средним рейтингом 4.14.</a></span></li></ul></li><li><span><a href="#Определите-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-—-так-вы-исключите-из-анализа-брошюры" data-toc-modified-id="Определите-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-—-так-вы-исключите-из-анализа-брошюры-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры</a></span><ul class="toc-item"><li><span><a href="#Издательство,-которое-выпустило-наибольшее-число-книг--Penguin-Books" data-toc-modified-id="Издательство,-которое-выпустило-наибольшее-число-книг--Penguin-Books-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Издательство, которое выпустило наибольшее число книг -Penguin Books</a></span></li></ul></li><li><span><a href="#Определите-автора-с-самой-высокой-средней-оценкой-книг-—-учитывайте-только-книги-с-50-и-более-оценками" data-toc-modified-id="Определите-автора-с-самой-высокой-средней-оценкой-книг-—-учитывайте-только-книги-с-50-и-более-оценками-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками</a></span><ul class="toc-item"><li><span><a href="#Автор-книги-J.K.-Rowling/Mary-GrandPré----имеет-самую-высокую-среднюю-оценку" data-toc-modified-id="Автор-книги-J.K.-Rowling/Mary-GrandPré----имеет-самую-высокую-среднюю-оценку-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Автор книги J.K. Rowling/Mary GrandPré    имеет самую высокую среднюю оценку</a></span></li></ul></li><li><span><a href="#Посчитайте-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок." data-toc-modified-id="Посчитайте-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок.-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.</a></span><ul class="toc-item"><li><span><a href="#Среднее-количество-обзоров-от-пользователей---24." data-toc-modified-id="Среднее-количество-обзоров-от-пользователей---24.-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Среднее количество обзоров от пользователей - 24.</a></span></li></ul></li><li><span><a href="#Выводы" data-toc-modified-id="Выводы-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Выводы</a></span></li></ul></div>

## Цели исследования
- проанализировать базу данных крупного сервиса для чтения книг по подписке, чтобы сформулировать ценностное предложение для нового продукта.

### Подключение к базе данных

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
 'pwd': 'Sdf4$2;d-d30pp', # пароль
 'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
 'port': 6432, # порт подключения
 'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
 db_config['pwd'],
 db_config['host'],
 db_config['port'],
 db_config['db'])
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

## Исследуйте таблицы — выведите первые строки

In [3]:
list= ['books', 'authors', 'publishers', 'ratings', 'reviews']
for i in list:
    df = pd.io.sql.read_sql('''SELECT * FROM {}'''.format(i), con = engine)
    print('------------------------------------')
    print(i)
    print('------------------------------------')
    display(df.head())
    print(df.info())

------------------------------------
books
------------------------------------

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           1000 non-null   int64
 1   author_id         1000 non-null   int64
 2   title             1000 non-null   object
 3   num_pages         1000 non-null   int64
 4   publication_date  1000 non-null   object
 5   publisher_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB
None
------------------------------------
authors
------------------------------------

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   author_id  636 non-null    int64
 1   author     636 non-null    object
dtypes: int64(1), object(1)
memory usage: 10.1+ KB
None
------------------------------------
publishers
------------------------------------

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   publisher_id  340 non-null    int64
 1   publisher     340 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.4+ KB
None
------------------------------------
ratings
------------------------------------

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6456 entries, 0 to 6455
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating_id  6456 non-null   int64
 1   book_id    6456 non-null   int64
 2   username   6456 non-null   object
 3   rating     6456 non-null   int64
dtypes: int64(3), object(1)
memory usage: 201.9+ KB
None
------------------------------------
reviews
------------------------------------

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2793 entries, 0 to 2792
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   review_id  2793 non-null   int64
 1   book_id    2793 non-null   int64
 2   username   2793 non-null   object
 3   text       2793 non-null   object
dtypes: int64(2), object(2)
memory usage: 87.4+ KB
None

In [3]:
def table_info(table):
    query = '''SELECT * FROM {}'''.format(table) 
    df = pd.io.sql.read_sql(query, con = engine)
    print('------------------------------------')
    print(table)
    print('------------------------------------')
    display(df.head())
    print(df.info())
        
table_list= ['books', 'authors', 'publishers', 'ratings', 'reviews']

for table in table_list:
    table_info(table)

------------------------------------
books
------------------------------------

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           1000 non-null   int64
 1   author_id         1000 non-null   int64
 2   title             1000 non-null   object
 3   num_pages         1000 non-null   int64
 4   publication_date  1000 non-null   object
 5   publisher_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB
None
------------------------------------
authors
------------------------------------

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   author_id  636 non-null    int64
 1   author     636 non-null    object
dtypes: int64(1), object(1)
memory usage: 10.1+ KB
None
------------------------------------
publishers
------------------------------------

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   publisher_id  340 non-null    int64
 1   publisher     340 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.4+ KB
None
------------------------------------
ratings
------------------------------------

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6456 entries, 0 to 6455
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating_id  6456 non-null   int64
 1   book_id    6456 non-null   int64
 2   username   6456 non-null   object
 3   rating     6456 non-null   int64
dtypes: int64(3), object(1)
memory usage: 201.9+ KB
None
------------------------------------
reviews
------------------------------------

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2793 entries, 0 to 2792
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   review_id  2793 non-null   int64
 1   book_id    2793 non-null   int64
 2   username   2793 non-null   object
 3   text       2793 non-null   object
dtypes: int64(2), object(2)
memory usage: 87.4+ KB
None

### Таблицы хорошего качества, без пропусков. Все открылись.

## Посчитайте, сколько книг вышло после 1 января 2000 года

In [4]:
query = '''
            SELECT COUNT(book_id)
            FROM books
            WHERE publication_date > '2000-01-01'
        '''
df = pd.io.sql.read_sql(query, con = engine)
df

   count
0    819

### После 1 января 2000 года вышло 819 книга.

## Для каждой книги посчитайте количество обзоров и среднюю оценку

In [5]:
query = '''
            SELECT b.title,
                    COUNT(DISTINCT e.review_id) AS reviews,
                    ROUND(AVG(a.rating), 2) AS avg_rating                   
            FROM books b
            LEFT JOIN reviews e ON b.book_id = e.book_id
            LEFT JOIN ratings a ON b.book_id = a.book_id
            GROUP BY b.title
            ORDER BY reviews DESC
        '''
df = pd.io.sql.read_sql(query, con = engine)
df

                                                 title  reviews  avg_rating
0                                  Memoirs of a Geisha        8        4.14
1                              Twilight (Twilight  #1)        7        3.66
2    Harry Potter and the Chamber of Secrets (Harry...        6        4.29
3                                     The Glass Castle        6        4.21
4                                      Eat  Pray  Love        6        3.40
..                                                 ...      ...         ...
994    Anne Rice's The Vampire Lestat: A Graphic Novel        0        3.67
995                            The Natural Way to Draw        0        3.00
996   The Cat in the Hat and Other Dr. Seuss Favorites        0        5.00
997                          Essential Tales and Poems        0        4.00
998  Disney's Beauty and the Beast (A Little Golden...        0        4.00

[999 rows x 3 columns]

### Максимально количество обзоров набрала книга Memoirs of a Geisha- 8 шт со средним рейтингом 4.14.

##  Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры

In [6]:
query = '''
            SELECT p.publisher,
                    COUNT(b.book_id) AS count_books
            FROM publishers p
            LEFT JOIN books b ON p.publisher_id = b.publisher_id
            WHERE b.num_pages > 50
            GROUP BY p.publisher
            ORDER BY count_books DESC
            LIMIT 1
        '''
df = pd.io.sql.read_sql(query, con = engine)
df

       publisher  count_books
0  Penguin Books           42

### Издательство, которое выпустило наибольшее число книг -Penguin Books

## Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками

In [7]:
query = '''
            SELECT a.author,
                    AVG(r.rating) AS avg_rating
            FROM authors a
            LEFT JOIN books b ON a.author_id = b.author_id
            LEFT JOIN ratings r ON b.book_id = r.book_id
            WHERE b.book_id IN (SELECT book_id
                                FROM ratings
                                GROUP BY book_id
                                HAVING COUNT(rating) >=50)
            GROUP BY a.author   
            ORDER BY avg_rating DESC
            LIMIT 1
                                
        '''
df = pd.io.sql.read_sql(query, con = engine)
df

                       author  avg_rating
0  J.K. Rowling/Mary GrandPré    4.287097

### Автор книги J.K. Rowling/Mary GrandPré	имеет самую высокую среднюю оценку

## Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

In [8]:
query = '''
                SELECT FLOOR(AVG(g.reviews)) AS avg_reviews
                FROM (
                        SELECT username,
                                COUNT(DISTINCT review_id) AS reviews
                        FROM reviews
                        WHERE username IN (
                                        SELECT username
                                        FROM ratings
                                        GROUP BY username
                                        HAVING COUNT(rating) > 50
                                        ) 
                        GROUP BY username
                ) AS g
        '''
df = pd.io.sql.read_sql(query, con = engine)
df

   avg_reviews
0         24.0

### Среднее количество обзоров от пользователей - 24.

## Выводы
- открыли все датафреймы- пропусков нет.

`Итоги по исследованиям:`
- После 1 января 2000 года вышло 819 книга.
- Максимально количество обзоров набрала книга Memoirs of a Geisha- 8 шт со средним рейтингом 4.14.
- Издательство, которое выпустило наибольшее число книг -Penguin Books
- Автор книги J.K. Rowling/Mary GrandPré	имеет самую высокую среднюю оценку
- Среднее количество обзоров от пользователей - 24.